/* No comment provided by engineer. */
"And we don't store your card details on this device." = "And we don't store your card details on this device.";

/* No comment provided by engineer. */
"Before we transmit your card details, we encrypt them using SSL." = "Before we transmit your card details, we encrypt them using SSL.";

/* No comment provided by engineer. */
"Card Expiry is not valid" = "Card Expiry is not valid";

/* No comment provided by engineer. */
"Card Number" = "Card Number";

/* No comment provided by engineer. */
"Card Number is not valid" = "Card Number is not valid";

/* No comment provided by engineer. */
"Card Verification Code is not valid" = "Card Verification Code is not valid";

/* No comment provided by engineer. */
"Confirm" = "Confirm";

/* No comment provided by engineer. */
"CVC" = "CVC";

/* No comment provided by engineer. */
"Enter your CVC" = "Enter your CVC";

/* No comment provided by engineer. */
"Error" = "Error";

/* No comment provided by engineer. */
"First Name" = "First Name";

/* No comment provided by engineer. */
"Last Name" = "Last Name";

/* No comment provided by engineer. */
"MM/YYYY" = "MM/YYYY";

/* No comment provided by engineer. */
"Name on card is not valid" = "Name on card is not valid";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Token can not be blank" = "Token can not be blank";

